Repository: ayo-eyo/LiftLog
Catalog: LiftLog/Catalog/ExerciseNames.xcstrings
Source language: en
Languages: ru

source: Standing Alternating Dumbbell Press
ru: Попеременный жим гантелей стоя

source: Standing Barbell Calf Raise
ru: Подъём на носки со штангой стоя

source: Standing Barbell Press Behind Neck
ru: Жим штанги из-за головы стоя

source: Standing Bent-Over One-Arm Dumbbell Triceps Extension
ru: Разгибание гантели одной рукой на трицепс стоя в наклоне

source: Standing Bent-Over Two-Arm Dumbbell Triceps Extension
ru: Разгибание гантелей двумя руками на трицепс стоя в наклоне

source: Standing Biceps Cable Curl
ru: Сгибания рук на блоке стоя

source: Standing Biceps Stretch
ru: Растяжка бицепса стоя

source: Standing Bradford Press
ru: Жим Брэдфорда стоя

source: Standing Cable Chest Press
ru: Жим от груди в кроссовере стоя

source: Standing Cable Lift
ru: Подъём в кроссовере стоя (снизу вверх)

source: Standing Cable Wood Chop
ru: «Дровосек» в кроссовере стоя

source: Standing Calf Raises
ru: Подъём на носки стоя

source: Standing Concentration Curl
ru: Концентрированные сгибания стоя

source: Standing Dumbbell Calf Raise
ru: Подъём на носки с гантелями стоя

source: Standing Dumbbell Press
ru: Жим гантелей стоя

source: Standing Dumbbell Reverse Curl
ru: Сгибания с гантелями обратным хватом стоя

source: Standing Dumbbell Straight-Arm Front Delt Raise Above Head
ru: Подъём гантели прямыми руками над головой стоя

source: Standing Dumbbell Triceps Extension
ru: Разгибания с гантелью на трицепс стоя

source: Standing Dumbbell Upright Row
ru: Тяга гантелей к подбородку стоя

source: Standing Elevated Quad Stretch
ru: Растяжка квадрицепса стоя с опорой

source: Standing Front Barbell Raise Over Head
ru: Подъём штанги перед собой над головой стоя

source: Standing Gastrocnemius Calf Stretch
ru: Растяжка икроножной мышцы стоя

source: Standing Hamstring and Calf Stretch
ru: Растяжка бицепса бедра и икр стоя

source: Standing Hip Circles
ru: Вращения тазом стоя

source: Standing Hip Flexors
ru: Растяжка сгибателей бедра стоя

source: Standing Inner-Biceps Curl
ru: Сгибания стоя с разведением рук

source: Standing Lateral Stretch
ru: Растяжка в сторону стоя

source: Standing Leg Curl
ru: Сгибание ноги стоя

source: Standing Long Jump
ru: Прыжок в длину с места

source: Standing Low-Pulley Deltoid Raise
ru: Подъём руки с нижнего блока стоя

source: Standing Low-Pulley One-Arm Triceps Extension
ru: Разгибание одной руки на трицепс с нижнего блока стоя

source: Standing Military Press
ru: Армейский жим стоя

source: Standing Olympic Plate Hand Squeeze
ru: Сжатие олимпийского блина кистями стоя

source: Standing One-Arm Cable Curl
ru: Сгибание одной руки на блоке стоя

source: Standing One-Arm Dumbbell Curl Over Incline Bench
ru: Сгибание гантели одной рукой стоя через наклонную скамью

source: Standing One-Arm Dumbbell Triceps Extension
ru: Разгибание гантели одной рукой на трицепс стоя

source: Standing Overhead Barbell Triceps Extension
ru: Разгибание штанги на трицепс из-за головы стоя

source: Standing Palm-In One-Arm Dumbbell Press
ru: Жим гантели одной рукой нейтральным хватом стоя

source: Standing Palms-In Dumbbell Press
ru: Жим гантелей нейтральным хватом стоя

source: Standing Palms-Up Barbell Behind The Back Wrist Curl
ru: Сгибания запястий со штангой за спиной стоя

source: Standing Pelvic Tilt
ru: Наклон таза стоя

source: Standing Rope Crunch
ru: Скручивания с канатом стоя

source: Standing Soleus And Achilles Stretch
ru: Растяжка камбаловидной мышцы и ахилла стоя

source: Standing Toe Touches
ru: Наклоны к носкам стоя

source: Standing Towel Triceps Extension
ru: Разгибание на трицепс с полотенцем стоя

source: Standing Two-Arm Overhead Throw
ru: Бросок двумя руками из-за головы стоя

source: Star Jump
ru: Прыжок «звезда»

source: Step-up with Knee Raise
ru: Зашагивание с подъёмом колена

source: Step Mill
ru: Лестничный тренажёр

source: Stiff-Legged Barbell Deadlift
ru: Становая тяга со штангой на прямых ногах

source: Stiff-Legged Dumbbell Deadlift
ru: Становая тяга с гантелями на прямых ногах

source: Stiff Leg Barbell Good Morning
ru: Наклоны со штангой на прямых ногах

source: Stomach Vacuum
ru: Вакуум живота

source: Straight-Arm Dumbbell Pullover
ru: Пуловер с гантелью на прямых руках

source: Straight-Arm Pulldown
ru: Тяга верхнего блока прямыми руками

source: Straight Bar Bench Mid Rows
ru: Тяга штанги лёжа на скамье к середине корпуса

source: Straight Raises on Incline Bench
ru: Подъём прямых рук на наклонной скамье

source: Stride Jump Crossover
ru: Прыжок с выпадом и перекрёстом

source: Sumo Deadlift
ru: Становая тяга сумо

source: Sumo Deadlift with Bands
ru: Становая тяга сумо с резинками

source: Sumo Deadlift with Chains
ru: Становая тяга сумо с цепями

source: Superman
ru: Супермен

source: Supine Chest Throw
ru: Бросок от груди лёжа

source: Supine One-Arm Overhead Throw
ru: Бросок из-за головы одной рукой лёжа

source: Supine Two-Arm Overhead Throw
ru: Бросок из-за головы двумя руками лёжа

source: Suspended Fallout
ru: Выкатывание на петлях

source: Suspended Push-Up
ru: Отжимания на петлях

source: Suspended Reverse Crunch
ru: Обратные скручивания на петлях

source: Suspended Row
ru: Тяга на петлях

source: Suspended Split Squat
ru: Сплит-приседания на петлях

source: Svend Press
ru: Жим Свенда

source: T-Bar Row with Handle
ru: Тяга Т-грифа с рукоятью

source: Tate Press
ru: Жим Тейта

source: The Straddle
ru: Растяжка в седе ноги врозь

source: Thigh Abductor
ru: Отведение бедра в тренажёре

source: Thigh Adductor
ru: Приведение бедра в тренажёре

source: Tire Flip
ru: Переворот покрышки

source: Toe Touchers
ru: Касания носков

source: Torso Rotation
ru: Повороты корпуса

source: Trail Running/Walking
ru: Бег / ходьба по пересечённой местности

source: Trap Bar Deadlift
ru: Становая тяга с трэп-грифом

source: Tricep Dumbbell Kickback
ru: Разгибание гантели на трицепс в наклоне

source: Tricep Side Stretch
ru: Растяжка трицепса в сторону

source: Triceps Overhead Extension with Rope
ru: Разгибание на трицепс из-за головы с канатом

source: Triceps Pushdown
ru: Разгибания на трицепс на блоке

source: Triceps Pushdown - Rope Attachment
ru: Разгибания на трицепс на блоке с канатом

source: Triceps Pushdown - V-Bar Attachment
ru: Разгибания на трицепс на блоке с V-рукоятью

source: Triceps Stretch
ru: Растяжка трицепса

source: Tuck Crunch
ru: Скручивания с подтягиванием коленей

source: Two-Arm Dumbbell Preacher Curl
ru: Сгибания гантелей двумя руками на скамье Скотта

source: Two-Arm Kettlebell Clean
ru: Взятие двух гирь на грудь

source: Two-Arm Kettlebell Jerk
ru: Толчок гири двумя руками

source: Two-Arm Kettlebell Military Press
ru: Армейский жим двух гирь

source: Two-Arm Kettlebell Row
ru: Тяга двух гирь

source: Underhand Cable Pulldowns
ru: Тяга верхнего блока обратным хватом

source: Upper Back-Leg Grab
ru: Растяжка верха спины с захватом ноги

source: Upper Back Stretch
ru: Растяжка верха спины

source: Upright Barbell Row
ru: Тяга штанги к подбородку

source: Upright Cable Row
ru: Тяга к подбородку на блоке

source: Upright Row - With Bands
ru: Тяга к подбородку с резинками

source: Upward Stretch
ru: Растяжка вверх

source: V-Bar Pulldown
ru: Тяга верхнего блока с V-рукоятью

source: V-Bar Pullup
ru: Подтягивания на V-рукояти

source: Vertical Swing
ru: Вертикальные махи гантелью

source: Walking, Treadmill
ru: Ходьба на беговой дорожке

source: Weighted Ball Hyperextension
ru: Гиперэкстензия с медболом

source: Weighted Ball Side Bend
ru: Наклоны в сторону с медболом

source: Weighted Bench Dip
ru: Обратные отжимания от скамьи с отягощением

source: Weighted Crunches
ru: Скручивания с отягощением

source: Weighted Jump Squat
ru: Приседания с выпрыгиванием с отягощением

source: Weighted Pull Ups
ru: Подтягивания с отягощением

source: Weighted Sissy Squat
ru: Сисси-приседания с отягощением

source: Weighted Sit-Ups - With Bands
ru: Подъём корпуса с отягощением и резинками

source: Weighted Squat
ru: Приседания с отягощением

source: Wide-Grip Barbell Bench Press
ru: Жим штанги лёжа широким хватом

source: Wide-Grip Decline Barbell Bench Press
ru: Жим штанги широким хватом на скамье с обратным наклоном

source: Wide-Grip Decline Barbell Pullover
ru: Пуловер со штангой широким хватом на скамье с обратным наклоном

source: Wide-Grip Lat Pulldown
ru: Тяга верхнего блока широким хватом

source: Wide-Grip Pulldown Behind The Neck
ru: Тяга верхнего блока за голову широким хватом

source: Wide-Grip Rear Pull-Up
ru: Подтягивания широким хватом за голову

source: Wide-Grip Standing Barbell Curl
ru: Сгибания со штангой стоя широким хватом

source: Wide Stance Barbell Squat
ru: Приседания со штангой в широкой стойке

source: Wide Stance Stiff Legs
ru: Становая тяга на прямых ногах в широкой стойке

source: Wind Sprints
ru: Спринтерские ускорения

source: Windmills
ru: Мельницы

source: World's Greatest Stretch
ru: Лучшая растяжка в мире

source: Wrist Circles
ru: Вращения запястьями

source: Wrist Roller
ru: Ролик для запястий

source: Wrist Rotations with Straight Bar
ru: Вращения запястьями с прямым грифом

source: Yoke Walk
ru: Прогулка с коромыслом

source: Zercher Squats
ru: Приседания Зерхера

source: Zottman Curl
ru: Сгибания Зоттмана

source: Zottman Preacher Curl
ru: Сгибания Зоттмана на скамье Скотта
